run/copyFallingDrop/system/refineMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

set             centerRegion;

coordinateSystem global;

globalCoeffs
{
    e1              	(1 0 0);
    e2              	(0 1 0);
    nBufferLayers	2;
    maxRefinement	1;
}

directions // comment out as required
(
    e1
    //e2
    e3
);

useHexTopology  yes;

geometricCut    no;

writeMesh       no;

// ************************************************************************* //
