run/copyFallingDrop/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volVectorFieldValue U (0. 0. 0.)
);

regions
(
    sphereToCell
    {
        centre (0 0 0.0096);
        radius 1.5e-3;
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volVectorFieldValue U (0. 0. -2.2523)
        );
    }
    
    boxToCell
    {
    	box (-1 -1 -1) (1 1 6e-3);
    	fieldValues
    	(
    	    volScalarFieldValue alpha.water 1
    	);
    }
);


// ************************************************************************* //
